In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [70]:
df=pd.read_csv('calendar.csv')

In [71]:
df.shape

(1393570, 4)

In [72]:
df.head(10)

   listing_id        date available   price
0      241032  2016-01-04         t  $85.00
1      241032  2016-01-05         t  $85.00
2      241032  2016-01-06         f     NaN
3      241032  2016-01-07         f     NaN
4      241032  2016-01-08         f     NaN
5      241032  2016-01-09         f     NaN
6      241032  2016-01-10         f     NaN
7      241032  2016-01-11         f     NaN
8      241032  2016-01-12         f     NaN
9      241032  2016-01-13         t  $85.00

In [73]:
df.isnull().sum()

listing_id         0
date               0
available          0
price         459028
dtype: int64

In [74]:
df.available.value_counts()

t    934542
f    459028
Name: available, dtype: int64

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1393570 entries, 0 to 1393569
Data columns (total 4 columns):
 #   Column      Non-Null Count    Dtype
---  ------      --------------    -----
 0   listing_id  1393570 non-null  int64
 1   date        1393570 non-null  datetime64[ns]
 2   available   1393570 non-null  object
 3   price       934542 non-null   object
dtypes: datetime64[ns](1), int64(1), object(2)
memory usage: 42.5+ MB

In [76]:
df['date']=pd.to_datetime(df['date'])

In [78]:
dic={'t':1, 'f':0}
df['available']=df['available'].map(dic)

In [79]:
lis1=df.groupby(['listing_id'])['available'].mean()
df1=df

In [80]:
df2=pd.DataFrame(lis1)
df=pd.merge(df1,df2, left_on='listing_id', right_on='listing_id')
df.shape

(1393570, 5)

In [81]:
df=df.rename(columns={'available_x':'available','available_y':'rentability'})
df

         listing_id       date  available   price  rentability
0            241032 2016-01-04          1  $85.00     0.947945
1            241032 2016-01-05          1  $85.00     0.947945
2            241032 2016-01-06          0     NaN     0.947945
3            241032 2016-01-07          0     NaN     0.947945
4            241032 2016-01-08          0     NaN     0.947945
...             ...        ...        ...     ...          ...
1393565    10208623 2016-12-29          0     NaN     0.019178
1393566    10208623 2016-12-30          0     NaN     0.019178
1393567    10208623 2016-12-31          0     NaN     0.019178
1393568    10208623 2017-01-01          0     NaN     0.019178
1393569    10208623 2017-01-02          0     NaN     0.019178

[1393570 rows x 5 columns]

In [85]:
df.groupby(['listing_id'])['available'].sum()

listing_id
3335        309
4291        365
5682        309
6606        365
7369         53
           ...
10332096    365
10334184    361
10339144      0
10339145    365
10340165    358
Name: available, Length: 3818, dtype: int64